# Temperature Rating Id Property

Source: https://www.revitapidocs.com/2026/59a5bc78-d152-58b4-1c20-05881f519e2b.htm

---

| Temperature Rating Id Property |
| --- |

The Conductor Temperature Rating id.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId Id { get; }
```

```
Public ReadOnly Property Id As ElementId
	Get
```

```
public:
property ElementId^ Id {
	ElementId^ get ();
}
```

```
member Id : ElementId with get
```

#### Property Value

ElementId See Also

#### Reference

TemperatureRating Class Autodesk.Revit.DB.Electrical Namespace